# MaterialCategory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..MaterialCategory Property
Material Class See Also
---
The name of the material category, e.g. 'Wood'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string MaterialCategory { get; set; }
```

Visual Basic
---
```text
Public Property MaterialCategory As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ MaterialCategory {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Material Class
Autodesk.Revit.DB Namespace